src_ext/Documents/УЗ_ДополнительныеРасходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_ДополнительныеРасходы</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_Расходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_Урок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>УЗ_Настройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОкругление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребоватьОписаниеКНеоплаченнымУрокам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребоватьОписаниеКНеоплаченнымУрокамС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОповещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодОповещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОповещатьОЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/AccumulationRegisters/УЗ_Расходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>УЗ_Расходы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src_ext/Documents/УЗ_ДополнительныеРасходы/Ext/ObjectModule.bsl
//Доп. расходы — неденежный или уже оплаченный расход студии по статьям (отчёт «Расходы»). Денежный расход из кассы
//— РКО «Прочий расход», он сам пишет расход по статье. Правило «один расход вводится один раз»:
//  * материалы урока — таблица «Расходы» в самом уроке ИЛИ документ «Доп. расходы» на основании урока, не оба:
//    документ по уроку с непустыми расходами урока не проводится, урок с расходами — при проведённом документе
//    по нему (подписка УЗ_РасходыУрокаОдинИсточник); документ по уроку виден в уроке — «Связанные документы»;
//  * организация документа по уроку — организация урока (В12).
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если НЕ ЗначениеЗаполнено(АвторДокумента) Тогда
		АвторДокумента = УЗ_Среда.ТекущийПользователь();
	КонецЕсли;

	СуммаДокумента = Расходы.Итог("Сумма");

	Если ЗначениеЗаполнено(ДокументОснования) Тогда
		Организация = ДокументОснования.Организация;
	ИначеЕсли НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = РегистрыСведений.УЗ_Настройки.Настройки().Организация;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ЭтоНовый() Тогда
		LMНастроки = РегистрыСведений.УЗ_Настройки.Настройки();
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, LMНастроки);
	КонецЕсли;

	//на основании урока: основание и организация урока (прежде организация бралась из настроек и затирала урок)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.УЗ_Урок") И ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		ДокументОснования = ДанныеЗаполнения;
		Организация = ДанныеЗаполнения.Организация;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	ПроверитьСтроки(Отказ);
	Если ЗначениеЗаполнено(ДокументОснования) Тогда
		РасходыУрока = ДокументОснования.Расходы.Выгрузить();
		Если РасходыУрока.Количество() > 0 Тогда
			УЗ_Общий.СообщитьОбОшибкеОбъекта(ЭтотОбъект,
				СтрШаблон(НСтр(
				"ru = 'Расходы урока %1 уже введены в самом уроке (вкладка «Доп. расходы»): %2. Один расход вводится "
				+ "один раз — либо в уроке, либо этим документом.'"),
				ДокументОснования, Формат(РасходыУрока.Итог("Сумма"), "ЧДЦ=2; ЧН=0,00")), "ДокументОснования", Отказ);
		КонецЕсли;
	КонецЕсли;
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	// регистр УЗ_Расходы Расход
	Движения.УЗ_Расходы.Записывать = Истина;
	Для Каждого ТекСтрокаРасходы Из Расходы Цикл
		Движение = Движения.УЗ_Расходы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период 			= Дата;
		Движение.СтатьяЗатрат 		= ТекСтрокаРасходы.СтатьяЗатрат;
		Движение.Сумма 				= ТекСтрокаРасходы.Сумма;
		Движение.Организация 		= Организация;
	КонецЦикла;

КонецПроцедуры

//Строка расхода: статья обязательна (по ней отчёт «Расходы»), сумма больше нуля.
Процедура ПроверитьСтроки(Отказ)

	Если Расходы.Количество() = 0 Тогда
		УЗ_Общий.СообщитьОбОшибкеОбъекта(ЭтотОбъект, НСтр("ru = 'Добавьте строки расходов: статья и сумма.'"),
			"Расходы", Отказ);
	КонецЕсли;
	Для Каждого ТекСтрокаРасходы Из Расходы Цикл
		Текст = УЗ_Сервер.ОшибкаСтрокиРасхода(ТекСтрокаРасходы);
		Если ЗначениеЗаполнено(Текст) Тогда
			УЗ_Общий.СообщитьОбОшибкеОбъекта(ЭтотОбъект, Текст,
				СтрШаблон("Расходы[%1].Сумма", ТекСтрокаРасходы.НомерСтроки - 1), Отказ);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ДокументОснования = Неопределено;
	Если Не ЗначениеЗаполнено(ОбъектКопирования.Организация) Тогда
		LMНастроки = РегистрыСведений.УЗ_Настройки.Настройки();
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, LMНастроки);
	КонецЕсли;
КонецПроцедуры
